reddit_on_rails/app/controllers/subs_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."sub_id" = $1  [["sub_id", 1]]
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        @sub = Sub.includes(:posts).find(params[:id])

INSERT INTO "subs" ("title", "description", "moderator_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Doggy Woggy!"], ["description", "Dogs n' Wogs"], ["moderator_id", 8], ["created_at", "2020-10-19 21:08:41.605259"], ["updated_at", "2020-10-19 21:08:41.605259"]]
---
    def create
        @sub = current_user.subs.new(sub_params)

        if @sub.save

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def edit
        @sub = Sub.find(params[:id])

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "subs" SET "description" = $1, "updated_at" = $2 WHERE "subs"."id" = $3  [["description", "Dogs n' Wogsdsasdf"], ["updated_at", "2020-10-19 21:17:07.134764"], ["id", 3]]
---
    def update
        @sub = Sub.find([params[:id]])

        if @sub.update(sub_params)